In [2]:
import pandas as pd

left = pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'Key': ['K0', 'K1', 'K4', 'K5'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

pd.concat([left, right], axis=1)

  Key   A   B Key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K4  C2  D2
3  K3  A3  B3  K5  C3  D3

In [3]:
# scalanie następuje na podstawie kolumn o takich samych nazwach w obu DF
# tutaj kolumny o tych samych nazwach w obu DF to Key
pd.merge(left, right)
pd.merge(left, right, how='outer')
pd.merge(left, right, how='left')
pd.merge(left, right, how='right')

  Key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C2  D2
3  K5  NaN  NaN  C3  D3

In [4]:
# on='nazwa_kolumny' na ktorej nastepuje scalanie
# tutaj jest tylko jedna wspolna kolumna KEY i scalanie wyglada identycznie jak powyzej
pd.merge(left, right, on='Key')
pd.merge(left, right, how='outer', on='Key')
pd.merge(left, right, how='left', on='Key')
pd.merge(left, right, how='right', on='Key')

  Key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C2  D2
3  K5  NaN  NaN  C3  D3

In [6]:
import pandas as pd

# LEFT DF
left = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Ala', 'Bartek', 'Celina', 'Daniel']
})

# RIGHT DF
right = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'city': ['Kraków', 'Warszawa', 'Gdańsk', 'Wrocław']
})

pd.concat([left, right], axis=1)

   id    name  id      city
0   1     Ala   3    Kraków
1   2  Bartek   4  Warszawa
2   3  Celina   5    Gdańsk
3   4  Daniel   6   Wrocław

In [ ]:
pd.merge(left, right, how='inner')  # domyślnie on='id'
pd.merge(left, right, how='left')
pd.merge(left, right, how='right')
pd.merge(left, right, how='outer')

In [8]:
# LEFT DF
left_n = pd.DataFrame({
    'user_id': [1, 2, 3, 4],
    'name': ['Ala', 'Bartek', 'Celina', 'Daniel']
})

# RIGHT DF
right_n = pd.DataFrame({
    'person_id': [3, 4, 5, 6],
    'city': ['Kraków', 'Warszawa', 'Gdańsk', 'Wrocław']
})

pd.concat([left_n, right_n], axis=1)

   user_id    name  person_id      city
0        1     Ala          3    Kraków
1        2  Bartek          4  Warszawa
2        3  Celina          5    Gdańsk
3        4  Daniel          6   Wrocław

In [9]:
pd.merge(left_n, right_n, how='inner', left_on='user_id', right_on='person_id')

   user_id    name  person_id      city
0        3  Celina          3    Kraków
1        4  Daniel          4  Warszawa

In [19]:
left_idx = left.set_index('id')
right_idx = right.set_index('id')

pd.merge(left_idx, right_idx, how='inner', left_index=True, right_index=True)

      name      city
id
3   Celina    Kraków
4   Daniel  Warszawa

In [10]:
import pandas as pd

# Przykład:
df1 = pd.DataFrame({
    'name': ['Ala', 'Bartek', 'Celina'],
    'age': [25, 30, 35]
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'city': ['Kraków', 'Warszawa', 'Gdańsk']
}, index=[2, 3, 4])

pd.concat([df1.reset_index(), df2.reset_index()], axis=1)

   index    name  age  index      city
0      1     Ala   25      2    Kraków
1      2  Bartek   30      3  Warszawa
2      3  Celina   35      4    Gdańsk

In [12]:
df1.join(df2) # how='left'
df1.join(df2, how='outer')

     name   age      city
1     Ala  25.0       NaN
2  Bartek  30.0    Kraków
3  Celina  35.0  Warszawa
4     NaN   NaN    Gdańsk

In [17]:
df3 = pd.DataFrame({
    'name': ['Ala', 'Celina', 'Daniel'],
    'city': ['Lublin', 'Łódź', 'Poznań']
})

pd.concat([df1.reset_index(), df3.reset_index()], axis=1)

# df1.join(df3.set_index('name'), on='name')

   index    name  age  index    name    city
0      1     Ala   25      0     Ala  Lublin
1      2  Bartek   30      1  Celina    Łódź
2      3  Celina   35      2  Daniel  Poznań

In [18]:
df1.join(df3.set_index('name'), on='name')

     name  age    city
1     Ala   25  Lublin
2  Bartek   30     NaN
3  Celina   35    Łódź

In [6]:
import pandas as pd

# DF1: informacje o osobach
df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Ala', 'Bartek', 'Celina', 'Daniel'],
    'age': [25, 30, 35, 40],
    'group': ['A', 'B', 'A', 'C']
})

# DF2: informacje uzupełniające (np. miasto, wynik)
df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'city': ['Kra', 'Waw', 'Gda', 'Wro'],
    'score': [88, 75, 91, 82],
    'group': ['A', 'C', 'B', 'A']
}, index=[1,2,3,4])

pd.concat([df1, df2], axis=1)

    id    name   age group   id city  score group
0  1.0     Ala  25.0     A  NaN  NaN    NaN   NaN
1  2.0  Bartek  30.0     B  3.0  Kra   88.0     A
2  3.0  Celina  35.0     A  4.0  Waw   75.0     C
3  4.0  Daniel  40.0     C  5.0  Gda   91.0     B
4  NaN     NaN   NaN   NaN  6.0  Wro   82.0     A

In [12]:
pd.merge(df1, df2, how='right')

   id    name   age group city  score
0   3  Celina  35.0     A  Kra     88
1   4  Daniel  40.0     C  Waw     75
2   5     NaN   NaN     B  Gda     91
3   6     NaN   NaN     A  Wro     82

In [11]:
pd.merge(df1, df2, how='left')

   id    name  age group city  score
0   1     Ala   25     A  NaN    NaN
1   2  Bartek   30     B  NaN    NaN
2   3  Celina   35     A  Kra   88.0
3   4  Daniel   40     C  Waw   75.0

In [9]:
pd.merge(df1, df2, how='outer')

   id    name   age group city  score
0   1     Ala  25.0     A  NaN    NaN
1   2  Bartek  30.0     B  NaN    NaN
2   3  Celina  35.0     A  Kra   88.0
3   4  Daniel  40.0     C  Waw   75.0
4   5     NaN   NaN     B  Gda   91.0
5   6     NaN   NaN     A  Wro   82.0

In [8]:
pd.merge(df1, df2) #default: how='inner'

   id    name  age group city  score
0   3  Celina   35     A  Kra     88
1   4  Daniel   40     C  Waw     75